app/controllers/pcr_controller.rb

SELECT `templates`.* FROM `templates`   ORDER BY `templates`.`title` DESC
---
  def index
    @templates = Template.all.order(title: :desc)

SELECT  `templates`.* FROM `templates`  WHERE `templates`.`id` = 1 LIMIT 1
---
  def show
    @template = Template.find(params[:id])